In [1]:
import pandas as pd

In [ ]:
order = pd.read_table('http://bit.ly/chiporders')

In [ ]:
order.head()

In [ ]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [ ]:
type(ufo)

In [ ]:
ufo.head()

In [ ]:
type(ufo['City'])

In [ ]:
ufo.info()

In [ ]:
#HOW TO RENAME THE COLUMNS IN A PANDA DATAFRAME
#There are 3 methods below

ufo = pd.read_csv('http://bit.ly/uforeports')

In [ ]:
ufo.head()

In [ ]:
#one method of replacing names of columns
ufo.rename(columns={"Colors Reported":"Colors_Reported"})

In [ ]:
#another method is by using the .columns
ufo_cols=['city','color reported','shape reported','state','time']
ufo.columns = ufo_cols

In [ ]:
ufo.head()

In [ ]:
#another one can be done while reading the csv 
ufo = pd.read_csv('http://bit.ly/uforeports',names=ufo_cols,header=0)

In [ ]:
ufo.head()

In [ ]:
# using the replace method
ufo.columns = ufo.columns.str.replace(' ','_')

In [ ]:
#HOW DO I REMOVE COLUMNS FROM A PANDAS DATAFRAME?

In [ ]:
ufo.head()

In [ ]:
#using inplace removes it from the dataframe 
#axis=1 is for column and axis=0 is for rows and it is the default
ufo.drop('color_reported',axis=1,inplace=True)

In [ ]:
ufo.head()

In [ ]:
#How do I sort a pandas DataFrame or Series?  
movies = pd.read_csv('http://bit.ly/imdbratings')

In [ ]:
movies.head()

In [ ]:
#sorting this way will return a series 
movies['title'].sort_values().head()

In [ ]:
#this method will return the dataframe 
movies.sort_values('title')

In [ ]:
#sorting by multiple columns 
movies.sort_values(['content_rating','duration'])

In [ ]:
#filter rows of a pandas by column value
movies = pd.read_csv('http://bit.ly/imdbratings')

In [ ]:
movies.head()

In [ ]:
movies.shape

In [ ]:
#sort the data
movies[movies['duration']>=200].sort_values(by='duration')['genre']

In [ ]:
#How do I apply multiple filter criteria to a pandas DataFrame?

In [ ]:
import pandas as pd

In [ ]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [ ]:
movies.head()

In [ ]:
#the parathensis is very important to give order for conditions
movies[(movies['duration']>=200) & (movies['genre']=='Drama')]

In [ ]:
#for multiple things to look for
movies[movies['genre'].isin(['Crime','Action'])].count()

In [3]:
#how do Dataframes and Series work with regard to selecting individual entries and iteraion (for X in userdata)
ufo = pd.read_csv('http://bit.ly/uforeports',nrows=3)

In [4]:
 ufo

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00

In [7]:
for index,row in ufo.iterrows():
    print (index,row.City,row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO

In [8]:
#best way to drop every non-numeric column in DataFrame 
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [10]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [14]:
import numpy as np
drinks.select_dtypes(include=[np.number]).head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [16]:
#describe includes only numerical values if you want non-numerical use the include in the parathensis
drinks.describe(include='all')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193,193.000000,193.000000,193.000000,193.000000,193
unique,193,NaN,NaN,NaN,NaN,6
top,Gabon,NaN,NaN,NaN,NaN,Africa
freq,1,NaN,NaN,NaN,NaN,53
mean,NaN,106.160622,80.994819,49.450777,4.717098,NaN
std,NaN,101.143103,88.284312,79.697598,3.773298,NaN
min,NaN,0.000000,0.000000,0.000000,0.000000,NaN
25%,NaN,20.000000,4.000000,1.000000,1.300000,NaN
50%,NaN,76.000000,56.000000,8.000000,4.200000,NaN
75%,NaN,188.000000,128.000000,59.000000,7.200000,NaN
max,NaN,376.000000,438.000000,370.000000,14.400000,NaN